import geopy.distance

zoneOut = 'в пути'

MapCoordinateTable = {
    'ЗЩ': '55.917435,38.028332',
    'ЗП': '56.362648418626925,38.1754601072619',
    '️КарьерСильницкий': '56.94091937142843,39.302723071369385',
    '️КарьерНерудПром': '56.861473,39.103031',
    '️КарьерМВК': '56.50650442111945,38.63897583037276',
    'Открытое30': '55.82834407,37.770358',
    'Долматово': '55.336014,37.739815',
    'Чулковское': '55.53631857019112,38.08103170400929',
    'ГенералаДорохова': '55.70859857064804,37.44834881463478',
    'КарьерХорошего': '56.583931,38.535072',
    'Книжная': '55.909946,37.899387',
    'ТракХолдинг': '55.982674,37.866776',
    'Ленина2а': '55.923794393946906,37.80811677612686',
    'ЗаречнаяСнег': '55.924244,38.049576',
    'Назимиха': '55.980682373046875,38.09538269042969',
    'СервисНогинск': '55.829086,38.389233',
    'ПортТураево': '55.558804,37.934391',
    'Лыткарино': '55.558570861816406,37.93376541137695',
    # 'Набережная': '55.751330, 37.526896,'
}

# for x in MapCoordinateTable:
#     print(MapCoordinateTable[x])


def getRad(region):
    if region == 'ЗЩ':
        rad = 0.25
    elif region == '️КарьерМВК':
        rad = 3.5
    elif region == 'ЗП':
        rad = 0.5
    elif region == 'ТракХолдинг':
        rad = 0.5
    elif region == '️КарьерСильницкий':
        rad = 4
    elif region == 'Долматово':
        rad = 1
    elif region == 'Открытое30':
        rad = 1
    elif region == 'Книжная':
        rad = 0.2
    elif region == 'Ленина2а':
        rad = 0.2
    elif region == 'ЗаречнаяСнег':
        rad = 0.4
    elif region == 'Назимиха':
        rad = 0.4
    elif region == 'СервисНогинск':
        rad = 0.4
    elif region == 'КарьерХорошего':
        rad = 0.4
    elif region == '️КарьерНерудПром':
        rad = 1
    elif region == 'ПортТураево':
        rad = 1
    elif region == 'Лыткарино':
        rad = 1
    # elif region == 'Набережная':
    #     rad = 1
    elif region == 'Чулковское':
        rad = 1
    elif region == 'ГенералаДорохова':
        rad = 1
    else:
        rad = 1
    return rad


# full = [[56.362648418626925,38.1754601072619], [56.94091937142843,39.302723071369385], [55.82834407,37.770358], [56.50650442111945,38.63897583037276]]
# left = full[0]
# right = full
# del right[0]
# t=(MapCoordinateTable['ЗЩ'])


# [56.362648418626925,38.1754601072619]


# [[56.94091937142843,39.302723071369385], [55.82834407,37.770358], [56.50650442111945,38.63897583037276]]

# [[56.362648418626925,38.1754601072619], [56.94091937142843,39.302723071369385], [55.82834407,37.770358], [56.50650442111945,38.63897583037276]]




# [55.916603, 38.030006]


# [[56.94091937142843,39.302723071369385], [55.82834407,37.770358], [56.50650442111945,38.63897583037276]]


# [[55.916603, 38.030006], [56.94091937142843,39.302723071369385], [55.82834407,37.770358], [56.50650442111945,38.63897583037276]]

# ['Asb', 'Cd', 'Ef', 'Gsch']

# Asb

# ['Cd', 'Ef', 'Gsch']



# [[55.82834407,37.770358],[55.336014,37.739815],[55.91746761,38.02953783]]
# [['Ош'],['До'],['Зщ']]

# [55.82834407,37.770358]
# ['Ош']

# [[55.336014,37.739815],[55.91746761,38.02953783]]
# [['До'],['Зщ']]

# 0км Открытое30
# [55.82834407,37.770358]

# 1.2км Открытое30
# [55.82247453,37.75472859]

# 0 км Долматово
# [55.336014,37.739815]

# 1.2км Долматово
# [55.33208535,37.71837119]


# 0км Посад
# [56.36264842,38.17546011]

# 0м завод щел
# [55.91746761,38.02953783]

# 800 м завод щел
# [55.91770746,38.01733511]






# 0км открытое шоссе 15
# [55.8077138,37.7251973]

# 1.5км открытое шоссе 15
# [55.82667607,37.71126496]